{
  "content": "The anchor of this project is the series of community engagements and co-creation process with the populations of Asian Americans from the North Callowhill/Chinatown area, students and staff from the Community College of Philadelphia, civic institutions, Black and Indigenous residents and stakeholders in the region who are working for a movement to connect land to sky and bring healing to earth and inhabitants along the way. In collaborating with major local community stakeholders (educational, ecological, cultural and infrastructural partners), we let the collaborative process guide the strategies for positive change in our communities that ultimately leads to a meaningful artistic expression.",
  "interviewees": {
    "content": "Throughout the project, we are conducting an interview series with selected members of Philadelphia's activist, civic, and grower communities. The interviews spotlight individuals who engage in the arts, urban gardening, community organizing, and climate justice.  Through personal narratives, they explain their current community-centered projects and speculate on the future climate. Below is a list of some of the interviewees. For more updates, visit AAI’s social media.",
    "individuals": [
      {
        "text": "Andrea Ferreira,",
        "anchor": "Epidemiologista | Doutora em Saúde Pública",
        "url": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do;jsessionid=506B8B3D729579318F02B9B888FF2809.buscatextual_0"
      },
      {
        "text": "Nicky Uy, Co-Founder of",
        "anchor": "Bahay 215",
        "url": "https://www.instagram.com/bahay215/"
      },
      {
        "text": "",
        "anchor": "",
        "url": ""
      },
      {
        "text": "",
        "anchor": "",
        "url": ""
      },
      {
        "text": "",
        "anchor": "",
        "url": ""
      },
      {
        "text": "",
        "anchor": "",
        "url": ""
      },
      {
        "text": "",
        "anchor": "",
        "url": ""
      }
    ]
  }
}
