[
  {
    "name": "Ashley Gripper",
    "bio": "aka Dr. Grip is a fifth generation Philadelphian with North Philly roots that trace back to South Carolina, Georgia, Virginia, and Texas. She is an environmental health scientist, an educator at heart and in practice, and a creator of nurturing spaces and experiences that nourish people’s spirits and desire for building community. Ashley founded and is now co-leading Land Based Jawns, a spiritually-rooted and spiritually-grounded project that offers land-based skills and healing workshops for Black Philadelphians. All of her work – interpersonally, professionally, and academically - is about helping Black folks' re-member and reclaim our relationships to the Creator, to our ancestors, to each other, and to our Earth mama. Ashley was a co-creator of Philadelphia’s First Urban Agriculture Plan, a multi-year project that has defined new ways to collaborate and share decision-making among grassroots organizers, City agencies, and urban planning firms.",
    "link": "",
    "photo": ""
  },
  {
    "name": "Sonia Galiber",
    "bio": "is a grower, educator, political organizer, and artist. As a member of Soil Generation, she does land, food, and environmental policy work, graphic design, and contributes to healing modalities and developing core theories. Philadelphia’s first Urban Agriculture Strategic Plan and Soil Generation’s Agroecology FROM the People are among the works she has helped co-create. Sonia is also an herbalist, hot sauce maker, and an artist of Japanese calligraphy and self-taught illustration. Sonia draws inspiration from her Afro-Okinawan roots and her deep reverence of the mystical natural world.",
    "link": "",
    "photo": "/assets/images/people/SoniaGaliber1.jpeg"
  },
  {
    "name": "Eto Otitigbe",
    "bio": "is a polymedia artist whose interdisciplinary practice includes sculpture, performance, installation, and public art. His practice intersects history, community, and biophilic design. Otitigbe’s public works includes temporary installations in Socrates Sculpture Park (Queens, NY) and Randall’s Island Park (New York, NY). He was a member of the Design Team for the Memorial to Enslaved Laborers at UVA (Charlottesville, VA) where he contributed to the creative expression on the memorial's exterior surface. Most recently, Peaceful Journey, a tribute to Heavy D, was completed in Mt. Vernon, NY. Otitigbe’s current public commissions include: Cascode (Philadelphia, PA) and Emanativ (Harlem, NY). He is the founder of eo Studio, which received the Creative Capital Grant in 2023 for the project Tankugbe Incubation Lab. Otitigbe’s fellowships and awards include The 2023 Augustus St. Gaudens Fellowship, The CEC Artslink Project Award for travel and cultural projects in Egypt, and The Smithsonian Artist Research Fellowship at the National Museum of African Art where he explored the intersection of Urhobo language and historical objects. He is an Assistant Professor of Sculpture in the Art Department at Brooklyn College. He received a B.S. in Mechanical Engineering from MIT, an M.S. in Product Design from Stanford University (M.S.) and an MFA in Creative Practice from the University of Plymouth.",
    "link": "http://www.etootitigbe.com/",
    "photo": "/assets/images/people/EtoOtitigbe.jpg"
  },
  {
    "name": "Amanda Kerdahi",
    "bio": "is a visual artist and DJ. Her installation work focuses on the evidence and residue of intimate conversations held between women in Cairo, Egypt. Kerdahi exhibits internationally, and in 2014, she received a grant from The Arab Fund for Arts and Culture for Filtered Conversations at Round Table. In 2018, she and Eto Otitigbe co-curated Topophilia, a video art exhibition with 16 international artists in an abandoned farmhouse in Nees, Denmark. She co-founded Benefsigy Studio, a 5 room artspace in downtown Cairo. Additionally, she organized Pop Up on the Nile, a series of women-centered dance parties on feluccas, which are popular motorboats on the Nile, and served as resident DJ. These vibrant events featured an eclectic mix of music deeply rooted in diaspora and encompassing multiple languages. She received a BFA in Digital Media, a BS in Psychology from the University of Houston and an MFA in Creative Practice from the University of Plymouth, UK. As part of eo Studio, she is a Creative Capital 2023 Awardee for Tankugbe Incubation Lab.",
    "link": "https://www.amandakm.com/",
    "photo": ""
  },
  {
    "name": "Zane Rodulfo",
    "bio": "is a drummer & composer living and working in Brooklyn, NY. Born and raised in Trinidad and Tobago, Rodulfo has been intrigued by the sound of music since an infant. He began studying and performing music at the early age of 4 and completed graduate study in Jazz Studies at New York University. He holds Bachelor of Music degrees in both Jazz Performance and Ethnomusicology from the Oberlin Conservatory Of Music. Zane has opened for iconic musicians such as Stevie Wonder and performs at various festivals and venues such as Jazz at Lincoln Center and Blue Note. He has also worked as composer and music coordinator for films and documentaries. Zane has partnered with and been commissioned by organizations such as the Guggenheim Museum, The Harlem Arts Alliance, the Brooklyn Arts Council and Hi-ARTS. His composition, Around The Circle, commissioned by the Guggenheim Museum, was part of the Vasily Kandinsky exhibition from August 2021 through September 2022. He focuses on publicly-engaging work addressing decolonization, the intersection of traditional and contemporary music, and ideas of transcendence. He performs and composes with electro-acoustic instruments, videos, and found/re-purposed instruments.",
    "link": "http://www.zanerodulfo.com/",
    "photo": "/assets/images/people/ZaneRodulfo.jpg"
  },
  {
    "name": "Chrissy Brimmage",
    "bio": "(she/they) is a multidisciplinary artist living and working out of Brooklyn, NY, by way of Atlanta, GA. Her practice integrates digital and material mediums and space to research the structures of consciousness & experience. She is currently interested in investigating social phenomenology, identity formation, spatial anthropology and embodied romance. She has shown works both nationally and internationally with PPOW Gallery in conjunction with Frieze Fair (New York), VMF Winter Arts (Vancouver), WISH Gallery (Atlanta) and more, and has taken residency with IMMENSIVA (Barcelona), Laboratory Interactive Art Residency (Spokane), and The Recurse Center (New York).",
    "link": "http://www.chrissybrimmage.com/",
    "photo": "/assets/images/people/ChrissyBrimmage.jpg"
  },
  {
    "name": "Rory Scott",
    "bio": "is a multidisciplinary artist, whose work utilizes animation, extended-reality (AR & VR) along with handcrafted means to create emotive environments & re-imagined life. Since 2010, her primary focus has been on her ongoing project Impermanence—which serves as both her life practice and visual body of work. Impermanence, as a practice, is an ongoing reflection and confrontation with the passage of time. An exercise of letting go and learning to use time as an agent of change, by creating deliberate & consistent patterns to achieve desired results. As a body of work, Impermanence embodies these ideas through the use of visual patterns & the creation of worlds that reflect the inner universe of memory, thought & mind. While also examining the origins of thought, belief and the perception of reality, through the use of dreamlike imagery and augmented worlds. These ideas in conjunction with Scott’s interest in futurism/technology and its relationship with humanity, form the foundation of her work. “If nothing else, I hope that my work opens up more minds to the true collective nature of reality. That the lives we live and the world we experience, are a mirror reflection of the patterns of our inner dialogue & thoughts. When you change your thoughts, you change your behaviors & actions and when you change your actions you change yourself, when you change yourself, you change your community & humanity in turn.”",
    "link": "",
    "photo": "/assets/images/people/RoryScott.jpg"
  },
  {
    "name": "Rudy Gerson",
    "bio": "(b. 1993) is an artist originally from Las Vegas, Nevada who currently lives and works in Philadelphia, PA. Rudy works across disciplines and media to investigate aesthetic expressions of diaspora and propose non-narrative and post-documentary approaches to historical inquiry. Alongside a studio practice, Rudy collaborates with artists and performers for public works, the stage, and installation. They performed at Abrons Arts Center (2019, 2022) with the River-to-River festival (2022), with Tania Bruguera (2018) and Julie Tolentino (2023). Rudy currently works as a member of eo Studio on two public artworks in Philadelphia. They studied Comparative Literature and Anthropology at Cornell University (B.A.) and received an MFA from the University of Pennsylvania.",
    "link": "http://www.rudygerson.info",
    "photo": "/assets/images/people/RudyGerson.jpg"
  },
  {
    "name": "Ann Adachi-Tasch",
    "bio": "is the Project Manager for the Invasive Species project. She is a musician, arts administrator, and mother of three children. Since 2010, Ann’s work has revolved around thinking about the interconnection and the economy between access and preservation, in particular pertaining to Japanese avant-garde moving image works, and has worked to open a wider access to its histories through digital platforms and exhibitions, while establishing a network of caretakers to preserve and secure longevity of film and video materials.",
    "link": "",
    "photo": ""
  }
]
